Public Attributes | List of all members
API_AnalyticalLink_Settings Struct Reference
Analytical Model
Describes the Structural Analytical Model Analytical Link settings. More...
#include <APIdefs_AnalyticalElements.h>
 Public Attributes
 API_AnalyticalLink_LinkGeometry  | geometry
The category of the link's geometry.
 API_AnalyticalLink_LinkType  | type
The type of the Analytical Link.
 API_AnalyticalLink_RigidSettings  | rigidSettings
The rigidity settings if the Analytical Link is of rigid type.
 API_AnalyticalLink_SpringSettings  | springSettings
The spring settings if the Analytical Link is of spring type.
Detailed Description
Describes the Structural Analytical Model Analytical Link settings.
Since
Archicad 25